In [1]:
import numpy as np
import pandas as pd

In [2]:
print(pd.__version__) # check pandas version

2.0.3

In [3]:
data = { 
    "names" : ["Anup","Aman","Vinay","Rohan"], 
    "marks" : [80,67,89,90],
    "native": ["Hebri","Mandarthi","Kundapura","Mangalore"]

}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   names  marks     native
0   Anup     80      Hebri
1   Aman     67  Mandarthi
2  Vinay     89  Kundapura
3  Rohan     90  Mangalore

In [7]:
df.to_csv('~/Program-Files/Jupyter-Files/data-files/marks.csv')

In [8]:
df.to_csv('~/Program-Files/Jupyter-Files/data-files/marks_indexless.csv',index=False)

In [9]:
df .head(2) # show first to rows

  names  marks     native
0  Anup     80      Hebri
1  Aman     67  Mandarthi

In [10]:
df.tail(2) # last two rows

   names  marks     native
2  Vinay     89  Kundapura
3  Rohan     90  Mangalore

In [11]:
df.describe()

           marks
count   4.000000
mean   81.500000
std    10.661457
min    67.000000
25%    76.750000
50%    84.500000
75%    89.250000
max    90.000000

In [12]:
emp = pd.read_csv('./../data-files/employees.csv') # relative path to file

In [13]:
emp # emp is a data frame

          Names               Email  Phone Number          Address
0     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
1    Mike Jones    mike@example.com  098-765-4321  321 Fake Avenue
2  Manya Shetty  manyas@example.com  020-998-7667     456 New York
3      Jane Doe    jane@example.com  112-345-6792  745 Park Avenue

In [14]:
print(type(emp))

<class 'pandas.core.frame.DataFrame'>

In [15]:
emp["Names"] # to get only name of all employees

0       Bob Smith
1      Mike Jones
2    Manya Shetty
3        Jane Doe
Name: Names, dtype: object

In [16]:
emp["Names"][1] # name at index 2

'Mike Jones'

In [17]:
# manipulating the data 

emp['Names'][3] = "Jhon Sams"
emp['Email'][3] = "jhon@example.com"
emp["Address"][1] = "001 New Avenue"
emp['Names'][1] = "Mary Jones"
emp["Email"][1] = "maryj@sample.com"

In [18]:
emp

          Names               Email  Phone Number          Address
0     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
1    Mary Jones    maryj@sample.com  098-765-4321   001 New Avenue
2  Manya Shetty  manyas@example.com  020-998-7667     456 New York
3     Jhon Sams    jhon@example.com  112-345-6792  745 Park Avenue

In [19]:
emp.to_csv('./../data-files/employees_modified.csv')

In [20]:
emp

          Names               Email  Phone Number          Address
0     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
1    Mary Jones    maryj@sample.com  098-765-4321   001 New Avenue
2  Manya Shetty  manyas@example.com  020-998-7667     456 New York
3     Jhon Sams    jhon@example.com  112-345-6792  745 Park Avenue

In [21]:
# Changing the indices of the rows

In [22]:
emp.index = ["First","Second","Third","Fourth"] # row indices can also be strings

In [23]:
emp

               Names               Email  Phone Number          Address
First      Bob Smith     bob@example.com  123-456-7890  123 Fake Street
Second    Mary Jones    maryj@sample.com  098-765-4321   001 New Avenue
Third   Manya Shetty  manyas@example.com  020-998-7667     456 New York
Fourth     Jhon Sams    jhon@example.com  112-345-6792  745 Park Avenue

In [24]:
type(emp) # emp is a pandas data-frame

pandas.core.frame.DataFrame

In [25]:
emp.index = [1,2,3,4] # changing the index of rows

In [26]:
emp # emp is a Data Frame

          Names               Email  Phone Number          Address
1     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
2    Mary Jones    maryj@sample.com  098-765-4321   001 New Avenue
3  Manya Shetty  manyas@example.com  020-998-7667     456 New York
4     Jhon Sams    jhon@example.com  112-345-6792  745 Park Avenue

In [27]:
# creating an array with random elements in given shape

In [28]:
myarr1 = np.random.rand(15)

In [29]:
myarr1

array([0.99331684, 0.31327907, 0.93223315, 0.67670656, 0.52782193,
       0.56520784, 0.89807279, 0.50038192, 0.03494253, 0.64624254,
       0.99478889, 0.16916903, 0.60684947, 0.83716412, 0.8982604 ])

In [30]:
myarr1.shape

(15,)

In [31]:
myarr2 = np.random.randn(10)

In [32]:
myarr2

array([-0.92444307,  0.50074979,  0.00862115, -0.94787896,  0.43245048,
        1.28568654, -1.0182109 ,  1.71450353, -0.37455108,  0.65561012])